; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	thermograph5 - mode
	image2 - mode
	infrared1 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	Star3 - direction
	Star4 - direction
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph5)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star2)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument2 thermograph5)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite1 Star0)
	(have_image Phenomenon5 thermograph5)
	(have_image Phenomenon5 spectrograph4)
	(have_image Star6 image0)
	(have_image Star6 spectrograph4)
	(have_image Phenomenon7 spectrograph4)
	(have_image Phenomenon7 thermograph5)
	(have_image Planet8 image0)
	(have_image Star9 image0)
	(have_image Star10 spectrograph3)
	(have_image Star10 thermograph5)
	(have_image Phenomenon11 thermograph5)
	(have_image Phenomenon12 thermograph5)
	(have_image Phenomenon12 spectrograph3)
))

)

; plan
1. (turn_to satellite1 star0 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star0)
   goals met: 1 of 14
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 14
3. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 14
4. (turn_to satellite1 phenomenon7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 14
5. (take_image satellite1 phenomenon7 instrument2 thermograph5)
   added: (have_image phenomenon7 thermograph5)
   goals met: 1 of 14
6. (turn_to satellite1 phenomenon5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon5)
   goals met: 1 of 14
7. (take_image satellite1 phenomenon5 instrument2 thermograph5)
   added: (have_image phenomenon5 thermograph5)
   goals met: 2 of 14
8. (turn_to satellite1 phenomenon11 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 14
9. (turn_to satellite0 star2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star2)
   goals met: 2 of 14
10. (take_image satellite1 phenomenon11 instrument2 thermograph5)
   added: (have_image phenomenon11 thermograph5)
   goals met: 3 of 14
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 14
12. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 3 of 14
13. (turn_to satellite0 phenomenon12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 14
14. (take_image satellite0 phenomenon12 instrument0 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 4 of 14
15. (take_image satellite0 phenomenon12 instrument0 thermograph5)
   added: (have_image phenomenon12 thermograph5)
   goals met: 5 of 14
16. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 5 of 14
17. (take_image satellite0 star10 instrument0 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 6 of 14
18. (take_image satellite0 star10 instrument0 thermograph5)
   added: (have_image star10 thermograph5)
   goals met: 7 of 14
19. (turn_to satellite1 planet8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet8)
   goals met: 7 of 14
20. (take_image satellite1 planet8 instrument2 image0)
   added: (have_image planet8 image0)
   goals met: 8 of 14
21. (turn_to satellite1 star6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star6)
   goals met: 8 of 14
22. (take_image satellite1 star6 instrument2 image0)
   added: (have_image star6 image0)
   goals met: 9 of 14
23. (turn_to satellite1 star9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star9)
   goals met: 9 of 14
24. (take_image satellite1 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 10 of 14
25. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 10 of 14
26. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 10 of 14
27. (turn_to satellite1 star1 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star1)
   goals met: 10 of 14
28. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 10 of 14
29. (turn_to satellite1 phenomenon5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon5)
   goals met: 10 of 14
30. (take_image satellite1 phenomenon5 instrument3 spectrograph4)
   added: (have_image phenomenon5 spectrograph4)
   goals met: 11 of 14
31. (turn_to satellite1 phenomenon7 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon7)
   goals met: 11 of 14
32. (take_image satellite1 phenomenon7 instrument3 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 12 of 14
33. (turn_to satellite1 star6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star6)
   goals met: 12 of 14
34. (take_image satellite1 star6 instrument3 spectrograph4)
   added: (have_image star6 spectrograph4)
   goals met: 13 of 14
35. (turn_to satellite1 star0 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star0)
   goals met: 14 of 14
